# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

first_var = 'Моя первая переменная Pyton' # first variable type str
second_var = 2 # second variable type int
third_var = True # third variable type bool

print('first_var = ', first_var, ' Type = ', type(first_var))
print('first_var = ', second_var, ' Type = ', type(second_var))
print('first_var = ', third_var, ' Type = ', type(third_var))

# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.






# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
